Revit 2027 API
MEPSystem.DivideSystem Method
 Divide the phyisical networks in the system and create a new system for each network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> DivideSystem(
	Document ADoc
)
Public Function DivideSystem (
	ADoc As Document
) As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ DivideSystem(
	Document^ ADoc
)
member DivideSystem :
        ADoc : Document -> ICollection<ElementId>
Parameters
ADoc Document
 The document.
Return Value
ICollection<ElementId>
 The id of new created systems.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The system is not dividable.
Remarks
 This function only works for Hvac and Piping system.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace